app/controllers/about_company_controller.rb

SELECT * FROM `aboutjrs` LIMIT 1
---
  def index

    @about_company = Aboutjr.first