app/controllers/contacts_controller.rb

  def index

    @store = Store.first
---
SELECT * FROM `stores` LIMIT 1

  def create

    @nome     = params[:nome_txt]
    @email    = params[:email_txt]
    @telefone = params[:telefone_txt]
    @msg      = params[:msg_tx]
    @news     = params[:news] || 0

    @contact  = Contact.find_by_email(@email)

    if @contact == nil
      @contact = Contact.new
    end

    @contact.name  = @nome
    @contact.email = @email
    @contact.tel   = @telefone
    @contact.news  = @news

    @contact.save
---
SELECT * FROM `contacts` WHERE (`contacts`.`email` = 'eduzera@gmail.com') LIMIT 1
INSERT INTO `contacts` (`name`, `created_at`, `updated_at`, `tel`, `news`, `email`) VALUES('Eduardo Zaghi', '2010-02-10 18:19:03', '2010-02-10 18:19:03', '33995786', 1, 'eduzera@gmail.com')
UPDATE `contacts` SET `updated_at` = '2010-02-10 18:22:29', `news` = 0 WHERE `id` = 1