app/controllers/home_controller.rb

  def index
    @type_insurance = TypeInsurance.all
---
SELECT * FROM `type_insurances`