app/controllers/insurance_company_list_controller.rb

SELECT * FROM `affiliates`
---
  def index
    @companies = Affiliate.all