app/controllers/locations_controller.rb

  def index

    @store = Store.first
---
SELECT * FROM `stores` LIMIT 1