app/controllers/products_controller.rb

  def show

    @insurance_show     = InsuranceBusiness.find (params[:id])
    @insurance_business = InsuranceBusiness.find_insurance_by_type(@insurance_show.insurance.name)
---
SELECT * FROM `insurance_businesses` WHERE (name LIKE '%AUTOMOVEIS%') LIMIT 1
SELECT * FROM `insurances` WHERE (`insurances`.`id` = 2)