app/controllers/sessions_controller.rb

SELECT * FROM `users` WHERE (login = 'Jr' and pass = '2011') LIMIT 1
---
  def create
    @user = User.find(:first ,
                       :conditions => ["login = ? and pass = ?",
                                      params[:user][:login].capitalize!, params[:user][:pass]])